import matplotlib.pyplot as plt
x = [0, 2, 3, 0, 0, 0, 2, 0, 0, 0, 2, 5, 2, 1, 1, 4, 2, 1, 2, 0, 0, 0, 1, 2]
y = ["Власова Каріна", "Власова Марина", "Войдюк Ігор", "Волощук Ростислав", "Давиденко Вікторія", "Давиденко Катерина", "Деморацький Назар", "Денисенко Владислав", "Євлахович Ігор", "Зінін Максим", "Ібе Джанет", "Карчевський Володимир", "Литвин Анастасія", "Лужанський Ростислав", "Мітькін Дмитро", "Мозговий Максим", "Моргун Ігор", "Мошняга Антон", "Орлов Андрій", "Паладій Даниїл", "Покотило Марія", "Прокопенко Роман", "Руденко Євгеній", "Сайфулліна Софія"]
plt.bar(y,x)
plt.title("grafik")
plt.xlabel("x")
plt.ylabel("y")
plt.show()